//problem 1
/**
 * কোন এরর দিবে না । কারন জাভাস্ক্রিপ্টে এটি Automatic Semicolon Insertion (ASI) প্রক্রিয়া অনুসরন করে। 
 * const name = "Mahbub"
 * */

//problem 2
/**
 *  ReferenceError সাধারণত তখন ঘটে যখন:
 * =====================================
 * কোনো ভেরিয়েবল ডিক্লেয়ার করা হয়নি
 * let বা const TDZ-র মধ্যে থাকা অবস্থায় অ্যাক্সেস করার চেষ্টা করলে
 * ভুল টাইপ করা ভেরিয়েবল বা ফাংশন কল করা হলে
 * স্কোপের বাইরে থাকা ভেরিয়েবল অ্যাক্সেস করার চেষ্টা করলে
 * ভুল মডিউল ইমপোর্ট করলে
 */


//problem 3
/**
 * SyntaxError তখন ঘটে যখন কোডের সিনট্যাক্স ভুল থাকে, যেমন বন্ধনী বা কোটেশন সঠিকভাবে না দেওয়া হলে। এটি এক্সিকিউশন শুরুর আগেই এরর দেয়।
 
 * TypeError তখন ঘটে যখন ভুল টাইপের ভেরিয়েবলে অপারেশন চালানো হয়, যেমন null.length বা 5.toUpperCase()। এটি কোড রান করার সময় এরর দেয়।
 */